import express from "express";

const evaluate_form = express();
evaluate_form.get("/evaluate/topic", async (req, res) => {
  const data = [
    {
      "หัวข้อประเมิน": "การส่งมอบสิ้นค้าตรงเวลา",
    },
    {
      "หัวข้อประเมิน": "การแต่งกายของเจ้าหน้าที่จัดส่งและความสุภาพ การปฏิบัติตนขณะขนส่ง",
    },
    {
      "หัวข้อประเมิน":
        "ชนิดสินค้าและจำนวนถูกต้องมีการจัดเรียงสินค้าเป็นระเบียบเรียบร้อยเมื่อส่งมอบงาน",
    },
    {
      "หัวข้อประเมิน": "เจ้าหน้าที่จัดส่งปฏิบัติตามกฏระบียบของบริษัทอย่างเคร่งครัด",
    },
    {
      "หัวข้อประเมิน":
        "ลักษณะทางกายภาพของหีบห่อที่บรรจุสินค้า (เช่น ไม่มีรอยฉีกขาด เป็นต้น)",
    },
    {
      "หัวข้อประเมิน": "ป้ายชื่อสินค้าถูกต้องตามมาตรฐาน,บรรจุหีบห่อถูกต้องตามข้อกำหนด",
    },
    {
      "หัวข้อประเมิน": "ความรวดเร็วในการแก้ปัญหา",
    },
    {
      "หัวข้อประเมิน": "ความสุภาพและการปฏิบัติของพนักงานบริษัท",
    },
    {
      "หัวข้อประเมิน": "การเป็นที่ปรึกษาให้คำแนะนำด้านเทคนิคผลิตภัณฑ์",
    },
    {
      "หัวข้อประเมิน": "ความสุภาพและการปฏิบัติของพนักงานขาย",
    },
    {
      "หัวข้อประเมิน": "ความสม่ำเสมอในการติดต่อและบริการ เอกสารต่าง ๆ ที่เกี่ยวข้อง",
    },
    {
      "หัวข้อประเมิน":
        "Certificate of Analysis [COA] (เช่น ความถูกต้อง ความครบถ้วน การตรงต่อเวลา เป็นต้น)",
    },
    {
      "หัวข้อประเมิน":
        "Quotation (ใบเสนอราคา) (เช่น ความรวดเร็ว ความถูกต้อง ความครบถ้วน เป็นต้น)",
    },
    {
      "หัวข้อประเมิน":
        "Invoice / เอกสารส่งมอบงาน (เช่น ความถูกต้อง ความครบถ้วน การตรงต่อเวลา เป็นต้น)",
    },
  ];
  res.status(200).send(data);
});
export default evaluate_form;
